{"backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1152, 832, 1], "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "strides": [2, 2], "padding": "valid", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_1", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_2", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_3", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 40, "strides": [1, 1], "padding": "valid", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_4", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_5", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_9", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_7", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_10", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_1", "strides": [1, 1], "padding": "same"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [5, 5], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_6", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_8", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_11", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_12", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "mixed0", "class_name": "Concatenate", "config": {"name": "mixed0", "trainable": true, "axis": -1}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_16", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_14", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_17", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_2", "strides": [1, 1], "padding": "same"}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [5, 5], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_13", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_15", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_18", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_19", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "mixed1", "class_name": "Concatenate", "config": {"name": "mixed1", "trainable": true, "axis": -1}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_23", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_23", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_21", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "conv2d_24", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_21", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_24", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_3", "strides": [1, 1], "padding": "same"}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "conv2d_22", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [5, 5], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_22", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "conv2d_25", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_25", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_26", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_20", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_22", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_25", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_26", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "name": "mixed2", "class_name": "Concatenate", "config": {"name": "mixed2", "trainable": true, "axis": -1}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_28", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_28", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "conv2d_29", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_29", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_29", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 192, "strides": [2, 2], "padding": "valid", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_27", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "conv2d_30", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [2, 2], "padding": "valid", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_30", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_27", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_30", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3", "class_name": "Concatenate", "config": {"name": "mixed3", "trainable": true, "axis": -1}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_35", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_35", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "conv2d_36", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "padding": "same", "kernel_size": [7, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_36", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_36", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_32", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "name": "conv2d_37", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "padding": "same", "kernel_size": [1, 7], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_37", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "name": "batch_normalization_32", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_32", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_37", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "name": "conv2d_33", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "padding": "same", "kernel_size": [1, 7], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_33", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "name": "conv2d_38", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "padding": "same", "kernel_size": [7, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_38", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "name": "batch_normalization_33", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_33", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "epsilon": 0.001, "trainable": true, "axis": 3, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_38", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_4", "strides": [1, 1], "padding": "same"}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_31", "class_name": "Conv2D", "config": {"activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "strides": [1, 1], "padding": "same", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_31", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], 