{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.6", "config": {"output_layers": [["output_layer", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 1152, 832, 1], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_1", "trainable": true, "filters": 16, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_1", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "filters": 16, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_2", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_3", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "trainable": true, "filters": 40, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_4", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_5", "trainable": true, "filters": 96, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_5", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_9", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_9", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_7", "trainable": true, "filters": 24, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_10", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_7", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_10", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"name": "average_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_6", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_8", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_11", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_12", "trainable": true, "filters": 16, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_6", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_8", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_11", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_12", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "mixed0", "config": {"axis": -1, "name": "mixed0", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_16", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_16", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_14", "trainable": true, "filters": 24, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_17", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_14", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_17", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2", "config": {"name": "average_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_13", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_15", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_18", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_19", "trainable": true, "filters": 16, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_13", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_15", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_18", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_19", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "mixed1", "config": {"axis": -1, "name": "mixed1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_23", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_23", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_21", "trainable": true, "filters": 24, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_24", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_21", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_24", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3", "config": {"name": "average_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_20", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_22", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "conv2d_25", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_25", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_26", "trainable": true, "filters": 16, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_20", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_22", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_25", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_26", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "name": "mixed2", "config": {"axis": -1, "name": "mixed2", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_28", "trainable": true, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_28", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "conv2d_29", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_29", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_29", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_27", "trainable": true, "filters": 192, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "conv2d_30", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "name": "conv2d_30", "trainable": true, "filters": 48, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "padding": "valid", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_27", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_30", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3]}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3", "config": {"axis": -1, "name": "mixed3", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_35", "trainable": true, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_35", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "conv2d_36", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_36", "trainable": true, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [7, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "batch_normalization_36", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_36", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_32", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_32", "trainable": true, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "name": "conv2d_37", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_37", "trainable": true, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [1, 7], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "name": "batch_normalization_32", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_32", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "name": "batch_normalization_37", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_37", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "name": "conv2d_33", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_33", "trainable": true, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [1, 7], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "name": "conv2d_38", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_38", "trainable": true, "filters": 64, "dilation_rate": [1, 1], "kernel_size": [7, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "name": "batch_normalization_33", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_33", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "name": "batch_normalization_38", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_38", "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "average_pooling2d_4", "config": {"name": "average_pooling2d_4", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_31", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_31", "trainable": true, "filters": 96, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "padding": "same", "bias_regularizer": 