{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 1152, 832, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 16, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 16, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 40, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 96, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 24, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"pool_size": [3, 3], "strides": [1, 1], "name": "average_pooling2d_1", "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 16, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "mixed0", "config": {"name": "mixed0", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 24, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_17", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2", "config": {"pool_size": [3, 3], "strides": [1, 1], "name": "average_pooling2d_2", "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_18", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 16, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "mixed1", "config": {"name": "mixed1", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_23", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_21", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 24, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_24", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3", "config": {"pool_size": [3, 3], "strides": [1, 1], "name": "average_pooling2d_3", "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_20", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_22", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [5, 5], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "conv2d_25", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_25", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_26", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 16, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "name": "mixed2", "config": {"name": "mixed2", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_28", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 32, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "conv2d_29", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_29", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27", "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "name": "conv2d_27", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 192, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "conv2d_30", "config": {"kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "name": "conv2d_30", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 48, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "trainable": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3", "config": {"name": "mixed3", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_35", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "conv2d_36", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_36", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [7, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "batch_normalization_36", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_32", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "name": "conv2d_37", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_37", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 7], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "name": "batch_normalization_32", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_32", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "name": "batch_normalization_37", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_37", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "name": "conv2d_33", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_33", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 7], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "name": "conv2d_38", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_38", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [7, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 64, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "name": "batch_normalization_33", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_33", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "name": "batch_normalization_38", "config": {"axis": 3, "center": true, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_38", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "average_pooling2d_4", "config": {"pool_size": [3, 3], "strides": [1, 1], "name": "average_pooling2d_4", "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_31", "config": {"kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "name": "conv2d_31", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "filters": 96, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", 