{"backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["output_layer", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 1152, 832, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"bias_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_1", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [2, 2], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_1", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"bias_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_2", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_2", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_3", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_3", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"bias_regularizer": null, "filters": 40, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_4", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_4", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "config": {"bias_regularizer": null, "filters": 96, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_5", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_5", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_9", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_9", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"bias_regularizer": null, "filters": 24, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_7", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_10", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "batch_normalization_7", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_7", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_10", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_10", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "config": {"name": "average_pooling2d_1", "padding": "same", "strides": [1, 1], "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_6", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_8", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [5, 5]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_11", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_12", "config": {"bias_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_12", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_6", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_8", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_8", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_11", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_11", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_12", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "mixed0", "config": {"trainable": true, "name": "mixed0", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_16", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_16", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "batch_normalization_16", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_16", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "conv2d_14", "config": {"bias_regularizer": null, "filters": 24, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_14", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_17", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_17", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "batch_normalization_14", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_14", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_17", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_17", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "config": {"name": "average_pooling2d_2", "padding": "same", "strides": [1, 1], "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_13", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_13", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_15", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_15", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [5, 5]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_18", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_18", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_19", "config": {"bias_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_19", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_13", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_13", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_15", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_18", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_18", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_19", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "mixed1", "config": {"trainable": true, "name": "mixed1", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_23", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_23", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "batch_normalization_23", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_23", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "conv2d_21", "config": {"bias_regularizer": null, "filters": 24, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_21", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_24", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_24", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "batch_normalization_21", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_21", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "batch_normalization_24", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_24", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "config": {"name": "average_pooling2d_3", "padding": "same", "strides": [1, 1], "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_20", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_20", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_22", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_22", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [5, 5]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_25", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_25", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "conv2d_26", "config": {"bias_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_26", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_20", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_20", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_22", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_22", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_25", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_25", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_26", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_26", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "mixed2", "config": {"trainable": true, "name": "mixed2", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]]}, {"name": "conv2d_28", "config": {"bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_28", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "batch_normalization_28", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_28", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "conv2d_29", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_29", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "batch_normalization_29", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_29", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "conv2d_27", "config": {"bias_regularizer": null, "filters": 192, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_27", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [2, 2], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "conv2d_30", "config": {"bias_regularizer": null, "filters": 48, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_30", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [2, 2], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"name": "batch_normalization_27", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_27", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_30", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_30", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "mixed3", "config": {"trainable": true, "name": "mixed3", "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_35", "config": {"bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_35", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "batch_normalization_35", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_35", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "conv2d_36", "config": {"bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_36", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [7, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"name": "batch_normalization_36", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_36", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"name": "conv2d_32", "config": {"bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_32", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_37", "config": {"bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_37", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 7]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"name": "batch_normalization_32", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_32", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"name": "batch_normalization_37", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_37", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"name": "conv2d_33", "config": {"bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_33", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 7]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"name": "conv2d_38", "config": {"bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_38", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [7, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "batch_normalization_33", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_33", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"name": "batch_normalization_38", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_38", "scale": true, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "config": {"name": "average_pooling2d_4", "padding": "same", "strides": [1, 1], "trainable": true, "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_31", "config": {"bias_regularizer": null, "filters": 96, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_31", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "kernel_size": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, 