{"config": {"name": "model_1", "output_layers": [["output_layer", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 1152, 832, 1]}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "trainable": true, "activity_regularizer": null, "filters": 16, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "batch_normalization_1", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "conv2d_2", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "trainable": true, "activity_regularizer": null, "filters": 16, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "batch_normalization_2", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "conv2d_3", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "batch_normalization_3", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "conv2d_4", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "valid", "trainable": true, "activity_regularizer": null, "filters": 40, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "batch_normalization_4", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "conv2d_5", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "trainable": true, "activity_regularizer": null, "filters": 96, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "batch_normalization_5", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "pool_size": [3, 3], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_9", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "batch_normalization_9", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_7", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 24, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "conv2d_10", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "batch_normalization_7", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"name": "batch_normalization_10", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "average_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_6", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "conv2d_8", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "conv2d_11", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"name": "conv2d_12", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 16, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "batch_normalization_6", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "batch_normalization_8", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "batch_normalization_11", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "batch_normalization_12", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "mixed0", "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "config": {"name": "mixed0", "axis": -1, "trainable": true}}, {"name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "conv2d_16", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"name": "batch_normalization_16", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "conv2d_14", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 24, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "conv2d_17", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "batch_normalization_14", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"name": "batch_normalization_17", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "average_pooling2d_2", "pool_size": [3, 3], "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "conv2d_13", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "conv2d_15", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"name": "conv2d_18", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"name": "conv2d_19", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 16, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "batch_normalization_13", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"name": "batch_normalization_15", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"name": "batch_normalization_18", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "batch_normalization_19", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "mixed1", "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "config": {"name": "mixed1", "axis": -1, "trainable": true}}, {"name": "conv2d_23", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "conv2d_23", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"name": "batch_normalization_23", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "conv2d_21", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 24, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_24", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"name": "conv2d_24", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"name": "batch_normalization_21", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"name": "batch_normalization_24", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "average_pooling2d_3", "pool_size": [3, 3], "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "conv2d_20", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_22", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"name": "conv2d_22", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_25", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"name": "conv2d_25", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_26", "class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"name": "conv2d_26", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 16, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "batch_normalization_20", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"name": "batch_normalization_22", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"name": "batch_normalization_25", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"name": "batch_normalization_26", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "mixed2", "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "config": {"name": "mixed2", "axis": -1, "trainable": true}}, {"name": "conv2d_28", "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "conv2d_28", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 32, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"name": "batch_normalization_28", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_29", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"name": "conv2d_29", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"name": "batch_normalization_29", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_27", "class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "conv2d_27", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "trainable": true, "activity_regularizer": null, "filters": 192, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_30", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"name": "conv2d_30", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "padding": "valid", "trainable": true, "activity_regularizer": null, "filters": 48, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"name": "batch_normalization_27", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"name": "batch_normalization_30", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "pool_size": [3, 3], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"name": "mixed3", "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "mixed3", "axis": -1, "trainable": true}}, {"name": "conv2d_35", "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"name": "conv2d_35", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 64, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"name": "batch_normalization_35", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_36", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"name": "conv2d_36", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [7, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 64, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"name": "batch_normalization_36", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_32", "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"name": "conv2d_32", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 64, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_37", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"name": "conv2d_37", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 7], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 64, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_32", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "config": {"name": "batch_normalization_32", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_37", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "config": {"name": "batch_normalization_37", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "conv2d_33", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "config": {"name": "conv2d_33", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 7], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 64, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_38", "class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "config": {"name": "conv2d_38", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [7, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 64, "use_bias": true, "data_format": "channels_last"}}, {"name": "batch_normalization_33", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "config": {"name": "batch_normalization_33", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "config": {"name": "batch_normalization_38", "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true}}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"name": "average_pooling2d_4", "pool_size": [3, 3], "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"name": "conv2d_31", "class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"name": "conv2d_31", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "activity_regularizer": null, "filters": 96, "use_bias": true, "data_format": "channels_last"}}, {"name": "conv2d_34", 