{"class_name": "Model", "keras_version": "2.0.6", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 1152, 832, 1], "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"filters": 16, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"filters": 16, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"filters": 40, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"filters": 96, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"filters": 24, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "data_format": "channels_last", "trainable": true, "padding": "same", "name": "average_pooling2d_1", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"filters": 16, "name": "conv2d_12", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Concatenate", "name": "mixed0", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "config": {"name": "mixed0", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_16", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"name": "batch_normalization_16", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"filters": 24, "name": "conv2d_14", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_17", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"name": "batch_normalization_17", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"strides": [1, 1], "data_format": "channels_last", "trainable": true, "padding": "same", "name": "average_pooling2d_2", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_13", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_15", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_18", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"filters": 16, "name": "conv2d_19", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"name": "batch_normalization_15", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"name": "batch_normalization_18", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "batch_normalization_19", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Concatenate", "name": "mixed1", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "config": {"name": "mixed1", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_23", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"name": "batch_normalization_23", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"filters": 24, "name": "conv2d_21", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_24", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"name": "batch_normalization_21", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"name": "batch_normalization_24", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"strides": [1, 1], "data_format": "channels_last", "trainable": true, "padding": "same", "name": "average_pooling2d_3", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_20", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_22", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_25", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"filters": 16, "name": "conv2d_26", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "batch_normalization_20", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"name": "batch_normalization_22", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"name": "batch_normalization_25", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"name": "batch_normalization_26", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Concatenate", "name": "mixed2", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "config": {"name": "mixed2", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"filters": 32, "name": "conv2d_28", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"name": "batch_normalization_28", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_29", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_29", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"name": "batch_normalization_29", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"filters": 192, "name": "conv2d_27", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_30", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "config": {"filters": 48, "name": "conv2d_30", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "strides": [2, 2], "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"name": "batch_normalization_27", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "config": {"name": "batch_normalization_30", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "pool_size": [3, 3]}}, {"class_name": "Concatenate", "name": "mixed3", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"name": "mixed3", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"filters": 64, "name": "conv2d_35", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"name": "batch_normalization_35", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_36", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "config": {"filters": 64, "name": "conv2d_36", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [7, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"name": "batch_normalization_36", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_32", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"filters": 64, "name": "conv2d_32", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_37", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "config": {"filters": 64, "name": "conv2d_37", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 7], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_32", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "config": {"name": "batch_normalization_32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_37", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "config": {"name": "batch_normalization_37", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_33", "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "config": {"filters": 64, "name": "conv2d_33", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 7], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_38", "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "config": {"filters": 64, "name": "conv2d_38", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [7, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_33", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "config": {"name": "batch_normalization_33", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_38", "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "config": {"name": "batch_normalization_38", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_4", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"strides": [1, 1], "data_format": "channels_last", "trainable": true, "padding": "same", "name": "average_pooling2d_4", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_31", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"filters": 96, "name": "conv2d_31", "bias_regularizer": null, "bias_constraint": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", 