{"backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1152, 832, 1], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "filters": 16, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "filters": 16, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "filters": 40, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_5", "filters": 96, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_9", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_7", "filters": 24, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_10", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "strides": [1, 1], "trainable": true, "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_1"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_6", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_8", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_11", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_12", "filters": 16, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "mixed0", "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed0", "axis": -1}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_16", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_14", "filters": 24, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_17", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "strides": [1, 1], "trainable": true, "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_2"}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_13", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_15", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_18", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_19", "filters": 16, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "mixed1", "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed1", "axis": -1}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_23", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_21", "filters": 24, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "conv2d_24", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_24", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "strides": [1, 1], "trainable": true, "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_3"}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_20", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "conv2d_22", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_22", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "conv2d_25", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_25", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_26", "filters": 16, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_22", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "name": "mixed2", "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed2", "axis": -1}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_28", "filters": 32, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "conv2d_29", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_29", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_27", "filters": 192, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "conv2d_30", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_30", "filters": 48, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3"}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3", "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed3", "axis": -1}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_35", "filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "conv2d_36", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_36", "filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_36", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_32", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_32", "filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "name": "conv2d_37", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_37", "filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 7], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "name": "batch_normalization_32", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_32", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_37", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "name": "conv2d_33", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_33", "filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 7], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "name": "conv2d_38", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_38", "filters": 64, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "name": "batch_normalization_33", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_33", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_38", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "strides": [1, 1], "trainable": true, "padding": "same", "data_format": "channels_last", "name": "average_pooling2d_4"}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_31", "class_name": "Conv2D", "config": {"activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_31", "filters": 96, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null}}, {"inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], 