{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1152, 832, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "filters": 16, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 16, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_3", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 40, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_4", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 96, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_5", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_9", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 24, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_7", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_10", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_1", "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 16, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_6", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_8", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_11", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_12", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "mixed0", "class_name": "Concatenate", "config": {"name": "mixed0", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_16", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 24, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_17", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_14", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_17", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_2", "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_18", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 16, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_13", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_15", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_18", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_19", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "mixed1", "class_name": "Concatenate", "config": {"name": "mixed1", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_23", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_23", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_21", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 24, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_24", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_21", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_24", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_3", "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_20", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_22", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_25", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_26", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 16, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_20", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_22", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_25", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_26", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "mixed2", "class_name": "Concatenate", "config": {"name": "mixed2", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_28", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_28", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_29", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_29", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_27", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "filters": 192, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_30", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "filters": 48, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_27", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_30", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "mixed3", "class_name": "Concatenate", "config": {"name": "mixed3", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_35", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_35", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_36", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [7, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_36", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_37", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_37", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 7], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"name": "batch_normalization_32", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_32", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_37", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"name": "conv2d_33", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_33", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 7], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_38", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [7, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "batch_normalization_33", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_33", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_38", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "name": "average_pooling2d_4", "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "name": "conv2d_31", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 96, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_size": [1, 1], "padding": "same", "kernel_constraint": null}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_34", "class_name": "Conv2D", "config": {"trainable": true, 