{"config": {"name": "model_1", "output_layers": [["output_layer", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float16", "name": "input_1", "batch_input_shape": [null, 1152, 832, 1]}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "activation": "relu", "padding": "valid"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "valid"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 80, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "valid"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 192, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "valid"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_5", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_9", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 48, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_10", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_1", "padding": "same", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [5, 5], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_11", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_12", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_6", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_11", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_12", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "mixed0", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed0"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_16", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_16", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 48, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_14", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_17", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_14", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_17", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_2", "padding": "same", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_13", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_15", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [5, 5], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_18", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_19", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_13", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_15", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_18", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_19", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "mixed1", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed1"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_23", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_23", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 48, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_21", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_24", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_21", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_24", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_3", "padding": "same", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_20", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_22", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [5, 5], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_25", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_26", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_20", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_22", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_25", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_26", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "mixed2", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed2"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_28", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_28", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_29", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_29", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 384, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_27", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "activation": "relu", "padding": "valid"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 96, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_30", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "activation": "relu", "padding": "valid"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_27", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_30", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "padding": "valid", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "mixed3", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed3"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_35", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_35", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_36", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [7, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_36", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_32", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_37", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_37", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 7], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"name": "batch_normalization_32", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_32", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_37", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"name": "conv2d_33", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_33", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 7], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_38", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [7, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "batch_normalization_33", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_33", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "scale": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": 3, "name": "batch_normalization_38", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_4", "padding": "same", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 192, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_31", "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "relu", "padding": "same"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_34", "class_name": "Conv2D", "config": 