{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["output_layer", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1152, 832, 1], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 16, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_1", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 16, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_2", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_3", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 40, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_4", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 96, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_5", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_9", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 24, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_7", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_10", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [5, 5], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_11", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 16, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_12", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_6", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_8", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_11", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_12", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "mixed0", "class_name": "Concatenate", "config": {"name": "mixed0", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_16", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_16", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 24, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_14", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_17", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_14", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_17", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "same"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_13", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [5, 5], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_15", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_18", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 16, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_19", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_13", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_15", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_18", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_19", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "mixed1", "class_name": "Concatenate", "config": {"name": "mixed1", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_23", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_23", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 24, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_21", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_24", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_21", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_24", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "same"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_20", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [5, 5], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_22", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_25", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 16, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_26", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_20", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_22", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_25", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_26", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "mixed2", "class_name": "Concatenate", "config": {"name": "mixed2", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 32, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_28", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_28", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_29", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_29", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 192, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_27", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 48, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_30", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [2, 2], "padding": "valid", "trainable": true}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_27", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_30", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "mixed3", "class_name": "Concatenate", "config": {"name": "mixed3", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_35", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_35", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 64, "kernel_size": [7, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_36", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_36", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_32", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_37", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 7], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_37", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"name": "batch_normalization_32", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_32", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_37", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"name": "conv2d_33", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 7], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_33", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 64, "kernel_size": [7, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_38", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "batch_normalization_33", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_33", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "center": true, "momentum": 0.99, "name": "batch_normalization_38", "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_4", "strides": [1, 1], "pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "same"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "filters": 96, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_31", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "trainable": true}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "conv2d_34", 