{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["output_layer", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1152, 832, 1], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_1", "activity_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_1", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_2", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_3", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_3", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_4", "activity_regularizer": null, "filters": 40, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_4", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_5", "activity_regularizer": null, "filters": 96, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_5", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_9", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_9", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_7", "activity_regularizer": null, "filters": 24, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_10", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_7", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_10", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"strides": [1, 1], "trainable": true, "name": "average_pooling2d_1", "padding": "same", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_6", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_size": [5, 5], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_8", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_11", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_12", "activity_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_6", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_8", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_11", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_12", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed0", "config": {"name": "mixed0", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_16", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_16", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_14", "activity_regularizer": null, "filters": 24, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_17", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_14", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_17", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"strides": [1, 1], "trainable": true, "name": "average_pooling2d_2", "padding": "same", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_13", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_size": [5, 5], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_15", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_18", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_19", "activity_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_13", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_15", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_18", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_19", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed1", "config": {"name": "mixed1", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_23", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_23", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_21", "activity_regularizer": null, "filters": 24, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_24", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_21", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_24", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_3", "config": {"strides": [1, 1], "trainable": true, "name": "average_pooling2d_3", "padding": "same", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_20", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"kernel_size": [5, 5], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_22", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_25", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_26", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_26", "activity_regularizer": null, "filters": 16, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_20", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_22", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_25", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_26", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed2", "config": {"name": "mixed2", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_28", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_28", "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_28", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_29", "config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_29", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_29", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_27", "config": {"kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_27", "activity_regularizer": null, "filters": 192, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_30", "config": {"kernel_size": [3, 3], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_30", "activity_regularizer": null, "filters": 48, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_27", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_30", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "mixed3", "config": {"name": "mixed3", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_35", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_35", "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_35", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_36", "config": {"kernel_size": [7, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_36", "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_36", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_32", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_32", "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_37", "config": {"kernel_size": [1, 7], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_37", "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_32", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_37", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_37", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_33", "config": {"kernel_size": [1, 7], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_33", "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_38", "config": {"kernel_size": [7, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_38", "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_33", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_38", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_38", "beta_constraint": null, "scale": true, "momentum": 0.99, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_4", "config": {"strides": [1, 1], "trainable": true, "name": "average_pooling2d_4", "padding": "same", "data_format": "channels_last", "pool_size": [3, 3]}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_31", "config": {"kernel_size": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_31", "activity_regularizer": null, "filters": 96, "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_constraint": null, "data_format": "channels_last"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, 