{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1152, 832, 1], "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 16, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 16, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_2"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_3"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_1"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 40, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_4"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 96, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_5"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_2"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_9"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 24, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_7"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_10"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_1"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_6"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_8"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_11"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 16, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_12"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed0"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "mixed0"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_16"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 24, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_14"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_17"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "conv2d_17"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_2"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_13"}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_15"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_18"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "conv2d_18"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 16, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_19"}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed1"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "mixed1"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_23"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 24, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_21"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_24"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "conv2d_24"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_3"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_20"}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_22"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "conv2d_22"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_25"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "conv2d_25"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 16, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_26"}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed2"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "name": "mixed2"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 32, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_28"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_29"}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "conv2d_29"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 192, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_27"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 48, "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_30"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "conv2d_30"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30"}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_3"}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "mixed3"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_35"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "kernel_size": [7, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_36"}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "conv2d_36"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "batch_normalization_36"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_32"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_32"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "kernel_size": [1, 7], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_37"}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "name": "conv2d_37"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_32", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "name": "batch_normalization_32"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_37", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "name": "batch_normalization_37"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "kernel_size": [1, 7], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_33"}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "name": "conv2d_33"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "bias_constraint": null, "kernel_size": [7, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_38"}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "name": "conv2d_38"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_33", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "name": "batch_normalization_33"}, {"class_name": "BatchNormalization", "config": {"scale": true, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_38", "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "name": "batch_normalization_38"}, {"class_name": "AveragePooling2D", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "pool_size": [3, 3], "trainable": true, "name": "average_pooling2d_4"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "average_pooling2d_4"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 96, "bias_constraint": null, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_31"}, "inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_31"}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "data_format": "channels_last", 