{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.6", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1152, 832, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"data_format": "channels_last", "name": "conv2d_1", "strides": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [3, 3], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"data_format": "channels_last", "name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 40, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"data_format": "channels_last", "name": "conv2d_5", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [3, 3], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"data_format": "channels_last", "name": "conv2d_9", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"data_format": "channels_last", "name": "conv2d_7", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"data_format": "channels_last", "name": "conv2d_10", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_1", "strides": [1, 1], "pool_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"data_format": "channels_last", "name": "conv2d_6", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"data_format": "channels_last", "name": "conv2d_8", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"data_format": "channels_last", "name": "conv2d_11", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"data_format": "channels_last", "name": "conv2d_12", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed0", "config": {"trainable": true, "name": "mixed0", "axis": -1}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"data_format": "channels_last", "name": "conv2d_16", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"data_format": "channels_last", "name": "conv2d_14", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"data_format": "channels_last", "name": "conv2d_17", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_2", "strides": [1, 1], "pool_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"data_format": "channels_last", "name": "conv2d_13", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"data_format": "channels_last", "name": "conv2d_15", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"data_format": "channels_last", "name": "conv2d_18", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"data_format": "channels_last", "name": "conv2d_19", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed1", "config": {"trainable": true, "name": "mixed1", "axis": -1}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"data_format": "channels_last", "name": "conv2d_23", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"data_format": "channels_last", "name": "conv2d_21", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24", "config": {"data_format": "channels_last", "name": "conv2d_24", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_3", "strides": [1, 1], "pool_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"data_format": "channels_last", "name": "conv2d_20", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"data_format": "channels_last", "name": "conv2d_22", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_25", "config": {"data_format": "channels_last", "name": "conv2d_25", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_26", "config": {"data_format": "channels_last", "name": "conv2d_26", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_22", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed2", "config": {"trainable": true, "name": "mixed2", "axis": -1}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_28", "config": {"data_format": "channels_last", "name": "conv2d_28", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_29", "config": {"data_format": "channels_last", "name": "conv2d_29", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_27", "config": {"data_format": "channels_last", "name": "conv2d_27", "strides": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 192, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_30", "config": {"data_format": "channels_last", "name": "conv2d_30", "strides": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [3, 3], "padding": "valid"}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed3", "config": {"trainable": true, "name": "mixed3", "axis": -1}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_35", "config": {"data_format": "channels_last", "name": "conv2d_35", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_36", "config": {"data_format": "channels_last", "name": "conv2d_36", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [7, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_36", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_32", "config": {"data_format": "channels_last", "name": "conv2d_32", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_37", "config": {"data_format": "channels_last", "name": "conv2d_37", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 7], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_32", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_37", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_37", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_33", "config": {"data_format": "channels_last", "name": "conv2d_33", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 7], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_38", "config": {"data_format": "channels_last", "name": "conv2d_38", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [7, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, {"inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_33", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_38", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_38", "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": 3, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_4", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_4", "strides": [1, 1], "pool_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_31", "config": {"data_format": "channels_last", "name": "conv2d_31", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "kernel_regularizer": null, "padding": "same", "activity_regularizer": null}}, 