{"keras_version": "2.0.6", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 1152, 832, 1], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_1", "filters": 16, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_2", "filters": 16, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_3", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "pool_size": [3, 3]}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_4", "filters": 40, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_5", "filters": 96, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "pool_size": [3, 3]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_9", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_7", "filters": 24, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_10", "filters": 48, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_1", "strides": [1, 1], "padding": "same", "pool_size": [3, 3]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_6", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_8", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5]}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_11", "filters": 48, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_12", "filters": 16, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed0", "config": {"trainable": true, "axis": -1, "name": "mixed0"}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_16", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_16", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_14", "filters": 24, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_17", "filters": 48, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_17", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_2", "strides": [1, 1], "padding": "same", "pool_size": [3, 3]}}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_13", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_15", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5]}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_18", "filters": 48, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_19", "filters": 16, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_15", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_18", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_19", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_18", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed1", "config": {"trainable": true, "axis": -1, "name": "mixed1"}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_23", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_23", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_21", "filters": 24, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_24", "filters": 48, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_21", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_24", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_3", "strides": [1, 1], "padding": "same", "pool_size": [3, 3]}}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_20", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_22", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5]}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_25", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_25", "filters": 48, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_26", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_26", "filters": 16, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_20", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_22", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_25", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_26", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed2", "config": {"trainable": true, "axis": -1, "name": "mixed2"}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_28", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_28", "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_28", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_29", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_29", "filters": 48, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_29", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_27", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_27", "filters": 192, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_30", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_30", "filters": 48, "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_27", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_30", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid", "pool_size": [3, 3]}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed3", "config": {"trainable": true, "axis": -1, "name": "mixed3"}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_35", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_35", "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_35", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_35", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_36", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_36", "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [7, 1]}}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_36", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_36", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_32", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_32", "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_37", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_37", "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 7]}}, {"inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_32", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_37", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_37", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_33", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_33", "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 7]}}, {"inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_38", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_38", "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [7, 1]}}, {"inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_33", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_38", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "axis": 3, "name": "batch_normalization_38", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_4", "config": {"trainable": true, "data_format": "channels_last", "name": "average_pooling2d_4", "strides": [1, 1], "padding": "same", "pool_size": [3, 3]}}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_31", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "conv2d_31", "filters": 96, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}}, {"inbound_nodes": [[["batch_normalization_33",